; domain
;Header and description

(define (domain blocks)

    ;remove requirements that are not needed
    (:requirements :typing :negative-preconditions :conditional-effects)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location locatable - object
        block agent - locatable
        static dynamic - block
        robot - agent
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (at ?obj - locatable ?loc - location) ; Object ?obj is at location ?loc)
        (on ?block1 - block ?block2 - block)
        (at-top ?block - block) ; Block ?block is at the top of its stack
        (gripper-empty)
        (holding ?robot - robot ?block - block) ; Robot ?robot is holding block ?block
        (path-blocked-from-to ?from - location ?to - location) ; Path from ?from to ?to is blocked
    )

    ; (:functions ;todo: define numeric functions here
    ; )

    ;define actions here
    (:action move
            :parameters (?robot - robot
                         ?from - location
                         ?to - location)

            :precondition (and
                (at ?robot ?from)
                (not (path-blocked-from-to ?from ?to)))

            :effect (and
                (not (at ?robot ?from))
                (at ?robot ?to))
    )

    (:action grasp
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (at ?block ?loc)
                        (gripper-empty)
                        (at-top ?block)
                      )

        :effect (and
                    (not (at ?block ?loc))
                    (holding ?robot ?block)
                    (not (gripper-empty))
                    (not (at-top ?block))
                    (forall (?below_block - block)
                        (when (on ?block ?below_block)
                            (at-top ?below_block)
                        )
                    )
                )
    )

    (:action place
        :parameters (?robot - robot
                     ?block - dynamic
                     ?loc - location)

        :precondition (and
                        (at ?robot ?loc)
                        (holding ?robot ?block)
                        (not (gripper-empty))
                      )

        :effect (and
                    (gripper-empty)
                    (not (holding ?robot ?block))
                    (at ?block ?loc)
                    (at-top ?block)
                    (forall (?below_block - block)
                        (when (and
                                (at ?below_block ?loc)
                                (at-top ?below_block)
                              )
                            (and
                                (not (at-top ?below_block))
                                (on ?block ?below_block)
                            )
                        )
                    )
                )

    )
)

; problem
(define (problem blocks_problem_2)
    (:domain blocks)
    (:objects block_2 block_3 block_4 block_5 - dynamic p1 p10 p2 p3 p4 p5 p6 p7 p8 p9 - location robot - robot block_1 - static)
    (:init (at block_1 p1) (at block_2 p2) (at block_3 p3) (at block_4 p4) (at block_5 p5) (at robot p6) (at-top block_5) (gripper-empty) (on block_2 block_1) (on block_3 block_2) (on block_4 block_3) (on block_5 block_4))
    (:goal (and (at block_2 p7) (at block_3 p8) (at block_4 p9) (at block_5 p10)))
)

; plan
1. (move robot p6 p5)
   deleted: (at robot p6)
   added: (at robot p5)
   goals met: 0 of 4
2. (grasp robot block_5 p5)
   deleted: (at block_5 p5) (gripper-empty) (at-top block_5)
   added: (holding robot block_5) (at-top block_4)
   goals met: 0 of 4
3. (move robot p5 p10)
   deleted: (at robot p5)
   added: (at robot p10)
   goals met: 0 of 4
4. (place robot block_5 p10)
   deleted: (holding robot block_5)
   added: (gripper-empty) (at block_5 p10) (at-top block_5)
   goals met: 1 of 4
5. (move robot p10 p4)
   deleted: (at robot p10)
   added: (at robot p4)
   goals met: 1 of 4
6. (grasp robot block_4 p4)
   deleted: (at block_4 p4) (gripper-empty) (at-top block_4)
   added: (holding robot block_4) (at-top block_3)
   goals met: 1 of 4
7. (move robot p4 p9)
   deleted: (at robot p4)
   added: (at robot p9)
   goals met: 1 of 4
8. (place robot block_4 p9)
   deleted: (holding robot block_4)
   added: (gripper-empty) (at block_4 p9) (at-top block_4)
   goals met: 2 of 4
9. (move robot p9 p3)
   deleted: (at robot p9)
   added: (at robot p3)
   goals met: 2 of 4
10. (grasp robot block_3 p3)
   deleted: (at block_3 p3) (gripper-empty) (at-top block_3)
   added: (holding robot block_3) (at-top block_2)
   goals met: 2 of 4
11. (move robot p3 p8)
   deleted: (at robot p3)
   added: (at robot p8)
   goals met: 2 of 4
12. (place robot block_3 p8)
   deleted: (holding robot block_3)
   added: (gripper-empty) (at block_3 p8) (at-top block_3)
   goals met: 3 of 4
13. (move robot p8 p2)
   deleted: (at robot p8)
   added: (at robot p2)
   goals met: 3 of 4
14. (grasp robot block_2 p2)
   deleted: (at block_2 p2) (gripper-empty) (at-top block_2)
   added: (holding robot block_2) (at-top block_1)
   goals met: 3 of 4
15. (move robot p2 p7)
   deleted: (at robot p2)
   added: (at robot p7)
   goals met: 3 of 4
16. (place robot block_2 p7)
   deleted: (holding robot block_2)
   added: (gripper-empty) (at block_2 p7) (at-top block_2)
   goals met: 4 of 4
